7zip
aalib
abseil-cpp
acl
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
aom
apparmor
appstream
appstream-glib
aquamarine
archlinux-keyring
at-spi2-core
atkmm
attr
audit
autoconf
automake
avahi
babl
base
base-devel
bash
bat
bc
binutils
bison
blas
blueman
bluez
bluez-libs
bluez-utils
boost-libs
brightnessctl
broot
brotli
btop
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cabextract
cairo
cairomm
cairomm-1.16
cava
cblas
cdparanoia
chromium
clang
cmake
compiler-rt
coreutils
cpio
cppdap
cpupower
cryptsetup
cuda
cuda-tools
cudnn
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
dkms
dmidecode
dos2unix
double-conversion
duktape
dvisvgm
e2fsprogs
efibootmgr
efivar
egl-gbm
egl-wayland
egl-x11
eglexternalplatform
eigen
ell
enchant
ethtool
exempi
exiv2
expat
fakeroot
fastfetch
fcft
ffcall
ffmpeg
fftw
file
filesystem
findutils
flac
flex
fmt
fontconfig
freeglut
freetype2
fribidi
fuse-common
fuse3
fuzzel
gamemode
gawk
gc
gcc
gcc-libs
gcc14
gcc14-libs
gcr-4
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
gegl
gettext
gflags
ghostscript
giflib
gimp
gimp-plugin-gmic
git
glew
glfw
glib-networking
glib2
glib2-devel
glibc
glibmm
glibmm-2.68
glslang
glu
gmic
gmp
gn
gnome-autoar
gnome-desktop
gnome-desktop-4
gnome-desktop-common
gnulib-l10n
gnupg
gnutls
gobject-introspection-runtime
google-glog
gperf
gperftools
gpgme
gpgmepp
gpm
gpsd
graphene
graphicsmagick
graphite
graphviz
grep
grim
groff
gsettings-desktop-schemas
gsettings-system-schemas
gsfonts
gsm
gssdp
gst-plugin-pipewire
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtkmm-4.0
gtkmm3
gts
guile
gum
gupnp
gupnp-dlna
gupnp-igd
gvfs
gzip
harfbuzz
harfbuzz-icu
hdf5
hicolor-icon-theme
hidapi
highway
htop
http-parser
hwdata
hwinfo
hwloc
hyfetch
hyphen
hyprcursor
hyprgraphics
hyprland
hyprland-qt-support
hyprland-qtutils
hyprlang
hyprlock
hyprpicker
hyprshot
hyprutils
hyprwayland-scanner
iana-etc
icu
ijs
imagemagick
imath
iniparser
intel-oneapi-common
intel-oneapi-compiler-shared-runtime-libs
intel-oneapi-mkl
intel-oneapi-openmp
intel-oneapi-tbb
intel-oneapi-tcm
intel-ucode
inxi
iproute2
iptables
iputils
iso-codes
iwd
jansson
jasper
java-runtime-common
jbig2dec
jbigkit
jq
jre8-openjdk
jre8-openjdk-headless
json-c
json-glib
jsoncpp
judy
kbd
kconfig
kcoreaddons
kcrash
kdbusaddons
keyutils
ki18n
kirigami
kitty
kitty-shell-integration
kitty-terminfo
kmod
knotifications
krb5
kwindowsystem
l-smash
lame
lapack
lcms2
leancrypto
lensfun
less
level-zero-loader
lib32-alsa-lib
lib32-alsa-plugins
lib32-audit
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-glib2
lib32-glibc
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libnm
lib32-libnsl
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libtirpc
lib32-libunistring
lib32-libva
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxinerama
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-nvidia-utils
lib32-openssl
lib32-p11-kit
lib32-pam
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libadwaita
libaec
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libcue
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libde265
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdvdnav
libdvdread
libebur128
libedit
libei
libelf
libepoxy
libevdev
libevent
libexif
libfabric
libfdk-aac
libffi
libfontenc
libfreeaptx
libgcrypt
libgdiplus
libgexiv2
libgirepository
libgit2
libglvnd
libgpg-error
libgsf
libgudev
libgxps
libheif
libice
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libiptcdata
libisl
libjpeg-turbo
libjxl
libksba
liblc3
libldac
libldap
libliftoff
liblqr
libluv
liblzf
libmanette
libmd
libmng
libmnl
libmodplug
libmpc
libmpdclient
libmypaint
libmysofa
libnautilus-extension
libnetfilter_conntrack
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnotify
libnsl
libnvme
libogg
libopenmpt
libosinfo
libp11-kit
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libportal
libportal-gtk4
libproxy
libpsl
libpulse
libraqm
libraw
libraw1394
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsigc++-3.0
libsigsegv
libsixel
libsm
libsndfile
libsodium
libsoup3
libsoxr
libspiro
libssh
libssh2
libstemmer
libsynctex
libsysprof-capture
libtasn1
libthai
libtheora
libtiff
libtirpc
libtool
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libutf8proc
libuv
libva
libva-nvidia-driver
libvdpau
libverto
libvorbis
libvpl
libvpx
libvterm
libwacom
libwebp
libwireplumber
libwmf
libx11
libx86emu
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmp
libxmu
libxnvctrl
libxpm
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
licenses
lilv
links
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
linux-zen
linux-zen-docs
linux-zen-headers
lksctp-tools
lld
llhttp
llvm
llvm-libs
lm_sensors
lmdb
localsearch
lsb-release
lshw
lsof
lua
lua51-lpeg
luajit
lutris
lv2
ly
lz4
lzo
m4
magma-cuda
make
mako
man-db
mangohud
md4c
mdadm
mesa
mesa-utils
minizip
mkinitcpio
mkinitcpio-busybox
mono
mpdecimal
mpfr
mpg123
mpv
msgpack-c
mtdev
mujs
mypaint-brushes1
nano
nautilus
nccl
ncurses
neovim
netpbm
nettle
ninja
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
npth
nspr
nss
numactl
nvidia-dkms
nvidia-prime
nvidia-settings
nvidia-utils
nvtop
ocl-icd
ollama
ollama-cuda
onednn
onetbb
oniguruma
openal
opencl-nvidia
opencore-amr
opencv
openexr
openh264
openjpeg2
openmp
openmpi
openpmix
openssh
openssl
openucx
opus
opusfile
orc
osinfo-db
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pamixer
pango
pangomm
pangomm-2.48
parted
patch
patchutils
pavucontrol
pciutils
pcre
pcre2
perl
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
perl-xml-writer
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
playerctl
polkit
polkit-kde-agent
polkit-qt6
poppler
poppler-data
poppler-glib
popt
portaudio
portmidi
potrace
pps-tools
procps-ng
protobuf
prrte
psmisc
pugixml
pulseaudio-alsa
pybind11
pyside6
python
python-absl
python-astor
python-astunparse
python-attrs
python-autocommand
python-babel
python-beautifulsoup4
python-bleach
python-build
python-cachetools
python-cairo
python-certifi
python-cffi
python-charset-normalizer
python-contourpy
python-cryptography
python-cycler
python-dateutil
python-dbus
python-distro
python-docutils
python-evdev
python-filelock
python-flatbuffers
python-fonttools
python-gast
python-gmpy2
python-gobject
python-google-auth
python-google-auth-oauthlib
python-grpcio
python-grpcio-tools
python-h5py
python-html5lib
python-httplib2
python-idna
python-imagesize
python-installer
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jinja
python-keras
python-kiwisolver
python-legacy-cgi
python-lxml
python-markdown
python-markdown-it-py
python-markupsafe
python-matplotlib
python-mdurl
python-ml-dtypes
python-moddb
python-more-itertools
python-mpmath
python-networkx
python-numpy
python-oauth2client
python-oauthlib
python-opt_einsum
python-optree
python-packaging
python-pandas
python-pasta
python-pillow
python-pip
python-platformdirs
python-pooch
python-protobuf
python-psutil
python-pyaml
python-pyasn1
python-pyasn1-modules
python-pycparser
python-pycryptodomex
python-pycuda
python-pydot
python-pygame
python-pygments
python-pyparsing
python-pyproject-hooks
python-pyqt5
python-pyqt5-sip
python-pytools
python-pytorch-cuda
python-pytz
python-pyxdg
python-requests
python-requests-oauthlib
python-rich
python-roman-numerals-py
python-rsa
python-scipy
python-setuptools
python-six
python-snowballstemmer
python-soupsieve
python-sphinx
python-sphinx-alabaster-theme
python-sphinxcontrib-applehelp
python-sphinxcontrib-devhelp
python-sphinxcontrib-htmlhelp
python-sphinxcontrib-jsmath
python-sphinxcontrib-qthelp
python-sphinxcontrib-serializinghtml
python-standard-cgi
python-sympy
python-tensorboard_plugin_wit
python-tensorflow-cuda
python-termcolor
python-typing_extensions
python-urllib3
python-webencodings
python-werkzeug
python-wheel
python-wrapt
python-yaml
python-zstandard
qhull
qt5-base
qt5-declarative
qt5-translations
qt5-wayland
qt6-base
qt6-declarative
qt6-svg
qt6-tools
qt6-translations
qt6-wayland
ranger
rav1e
re2
readline
realtime-privileges
reflector
rhash
rtkit
rubberband
rust
rust-bindgen
rust-src
sbc
scdoc
sdbus-cpp
sdl2-compat
sdl2_image
sdl2_mixer
sdl2_ttf
sdl3
seatd
sed
semver
serd
shaderc
shadow
shared-mime-info
shiboken6
simdjson
slang
slurp
smartmontools
snappy
sndio
sof-firmware
sord
sound-theme-freedesktop
source-highlight
spdlog
speex
speexdsp
spirv-tools
sqlite
sratom
srt
steam
stress-ng
sudo
suitesparse
svt-av1
swayidle
swww
systemd
systemd-libs
systemd-sysvcompat
tar
tcl
tdb
tensorboard
tensorflow-cuda
texinfo
texlive-basic
texlive-bin
texlive-latex
texlive-latexextra
texlive-latexrecommended
texlive-pictures
threejs-sage
throttled
tinysparql
tk
tomlplusplus
totem-pl-parser
tpm2-tss
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-cascadia-code-nerd
ttf-liberation
tumbler
turbostat
tzdata
uchardet
udisks2
unibilium
unzip
upower
usbutils
util-linux
util-linux-libs
uwsm
v4l-utils
vapoursynth
verdict
vid.stab
vim
vim-runtime
vmaf
volume_key
vulkan-headers
vulkan-icd-loader
vulkan-tools
wavemon
wayland
wayland-protocols
webkit2gtk-4.1
webrtc-audio-processing-1
wget
which
wine-gecko
wine-staging
wireless_tools
wireplumber
wl-clipboard
woff2
x264
x265
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xkeyboard-config
xorg-fonts-encodings
xorg-server-common
xorg-setxkbmap
xorg-xinput
xorg-xkbcomp
xorg-xprop
xorg-xrandr
xorg-xset
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yarn
yt-dlp
yyjson
zenity
zeromq
zimg
zix
zlib
zlib-ng
zram-generator
zstd
zziplib
